In [7]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [3]:
connection_str = "mysql+pymysql://root:root@localhost/BooksDB"

In [4]:
engine = create_engine(connection_str)

In [5]:
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

In [6]:
database_exists(connection_str)

True

In [16]:
users= pd.read_csv("users.csv")
books= pd.read_csv("books.csv")
authors= pd.read_csv("authors.csv")
favorites= pd.read_csv("favorites.csv")

In [17]:
users.to_sql('users', engine, if_exists = 'replace')
books.to_sql('books', engine, if_exists = 'replace')
authors.to_sql('authors', engine, if_exists = 'replace')
favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [20]:
q = """SELECT * FROM Authors LIMIT 5;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [21]:
s = """SHOW TABLES;"""
pd.read_sql(s, engine)

  Tables_in_booksdb
0           authors
1             books
2         favorites
3             users

In [23]:
test = """SELECT books.title, favorites.user_id
        FROM books
        JOIN favorites ON books.id = favorites.book_id
        WHERE favorites.user_id = 
        (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(test, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1